{
  "basics": {
    "name": "Jasvinder Singh Kwatra",
    "label": "Cloud Architect",
    "email": "jasvinder.kwatra@gmail.com",
    "phone": "+17708619182",
    "website": "https://www.linkedin.com/in/jasvinder-singh-kwatra-441804149/",
    "summary": "I have ten years of experience designing and implementing solutions with multiple industry-leading open source technologies. I am seeking a challenging new position where I can utilize my skill set to design and develop a robust and secure virtualization solution to satisfy market needs.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Austin",
      "countryCode": "USA",
      "state": "Texas"
    },
    "profiles": []
  },
  "work": [
    {
      "company": "Mirantis",
      "position": "Cloud Architect Kubernetes/OpenStack",
      "website": "",
      "startDate": "2018-03-01",
      "summary": "I am currently providing the highest-tier support and design consultation for a highly complex and continuously changing environment while utilizing DevOps methodology. My drive for learning and creating new things has enabled me to thrive in this challenging atmosphere.",
      "highlights": [
	              
                 "Restored an entire zone of 300 computes by creating a disaster recovery plan and executing it within 11 hours",
                 "Developed and provided a patch for an OpenStack nova-compute bug that causes a loss of connectivity between all OpenStack services. This bug had a widespread effect on multiple production environments and numerous high profile clients. This patch saved the company many person-hours by ending a two-year effort to find a solution and greatly improved the relationship with the client.",
                 "Recovered ceph cluster from pg corruption, avoiding any customer data loss.",
		 "Provided design feedback resulting in the overall stability of the Kubernetes, OpenStack, and non-OpenStack components of Airship. This feedback drastically increased the success of the rate of deployments.",
                 "Resolved a long-standing OOM issue affecting all nodes across multiple data centers. Identified the root cause to be a design flaw in the tuning of Numa memory and Hugepage settings.",
                 "Provided proof of concepts for multiple system architecture solutions",
		 "Took part in design discussions as well as defect resolutions.",
                 "Created disaster recovery procedures for various infrastructure components and wrote KBs for best practices.",
                 "Responsible for managing AT&T Integrated Cloud and Network cloud with 25K production and non-production bare-metal servers configured with both Open vSwitch and Juniper Contrail."
                     ]
    },
    {
      "company": "Tech Mahindra Americas Inc",
      "position": "Associate Technical Architect",
      "website": "",
      "startDate": "2016-09-01",
      "summary": "I was promoted to Technical Architect over AT&T's business service APIs. While in this position, I led a team of 25 people. I was awarded the 'ACE award 2017' for the second time and the 'Pat on the Back Award' in Q1 2018 for outstanding customer support.",
      "highlights": [
	             "Provided proof of concepts utilizing Kubernetes/OpenStack technologies.",
		     "Solved a high priority issue associated with JVM memory leaks and PostgreSQL, which caused numerous outages over six months period.",
		     "Provided RBAC use cases and manually converted non-SSL Kubernetes clusters to SSL with Kubeadm and Kubespray tools.",
                     "Created and updated Chef Cookbooks for infrastructure automation.",
		     "Created wrapper in the python to query 4000 servers, which helped reduce the mean time to restore."
                    ],
      "endDate": "2018-03-01"
    },
    {
      "company": "Tech Mahindra Americas Inc",
      "position": "Senior Software Engineer",
      "website": "",
      "startDate": "2015-11-01",
      "summary": "I was transferred to the USA and assigned as a lead over AT&T's business service APIs. I was awarded the 'ACE award 2016' for being a top performer and for receiving numerous positive client reviews.",
      "highlights": [ 
	             "Overcame budgetary limitations by migrating the Apigee platform and all associated APIs from tlsv1.0 to tlsv1.2 - effectively sidestepping a lack of vendor support.",
                     "Developed a plan to complete a challenging migration of 51 zones to a newer version of OpenStack. This task was previously determined to be impossible by the reporting development team.",
                     "Executed critical migration of 36 Cassandra nodes while maintaining 24 operational nodes with zero downtime.",
                     "Created and updated Chef Cookbooks for infrastructure automation.",
                     "Troubleshoot issues with memory leaks in JVM, Kernel, and APIs."
              ],
      "endDate": "2016-09-01"
    },
    {
      "company": "Tech Mahindra Ltd",
      "position": "Senior Software Engineer",
      "website": "",
      "startDate": "2014-03-01",
      "summary": "I worked for AT&T business service APIs. I have designed and built 51 environments of the AT&T API platform within three months of joining the project. Alongside received the Pat on the back award in the Q3 of 2014.",
      "highlights": [
	            "Built new environments using neutron and OpenStack.",
                    "Installed Apigee Edge cloud edition for exposing client APIs.",
                    "Configured Docker Containers for Jenkins and Gitlabs.",
                    "Configured Zookeeper and Cassandra nodes."
                   ],
      "endDate": "2015-11-01"
    },
    {
      "company": "Ericsson",
      "position": "Engineer",
      "website": "",
      "startDate": "2010-12-01",
      "summary": "I took charge of managing Ericsson datacenters across India. I designed and implemented an automated system that efficiently backed up critical file systems saving thousands of person-hours per project. This solution resulted in me receiving the 'Best Idea Award' in Q1 2013.",
      "highlights": [
                      "Developed preventive maintenance scripts for health checks on servers.",
                      "Proactively audited the network performance and identified issues with auto-negotiation, drastically reducing the number of outages due to performance issues."

                 ],
	      
      "endDate": "2014-03-01"
    }
  ],
  "education": [
    {
      "institution": "Guru Gobind Singh Indraprastha University",
      "area": "Computer Science",
      "studyType": "Bachelor of Technology - B-Tech",
      "startDate": "2006-07-01",
      "gpa": "",
      "courses": [""],
      "endDate": "2010-06-30"
    }
  ],
  "skills": [
    {
      "name": "Virtualizaion",
      "level": "Master",
      "keywords": [
	           "Kubernetes",
	           "OpenStack",
		   "AWS",
		   "Airship",
		   "OpenStack helm",
		   "Docker",
		   "Containerd",
		   "Cri",
		   "Coreos",
		   "Libvirt",
		   "Qemu"
                  ]
    },
    {
      "name": "Operating Systems",
      "level": "Master",
      "keywords": [
	           "Ubuntu",
	           "RHEL",
		   "Centos",
		   "Fedora",
		   "Solaris"
                  ]
    },
    {
      "name": "Coding Languages",
      "level": "Master",
      "keywords": [
	           "Python",
		   "C",
		   "Go"
                   ]
    },
    {
      "name": "Databases",
      "level": "Master",
      "keywords": ["Cassandra",
                   "Mongo",
                   "Postgres"
                   ]
    },
    {
      "name": "WebServices & protocols",
      "level": "Master",
      "keywords": [
	          "REST",
                  "Oauth",
		  "JWT",
		  "SSL",
		  "Postman"
                  ]
    },
    {
      "name": "Configuration Management and versioning tools",
      "level": "Master",
      "keywords": [
	           "Puppet",
                   "Chef",
		   "Git",
		   "Jenkins",
		   "Ansible",
		   "Salt"
                 ]
    },
    {
      "name": "Cluster Managers",
      "level": "Master",
      "keywords": [
	          "Etcd",
                  "Zookeeper"
                  ]
    },
    {
    "name": "Networking & Tools ",
    "level": "Master",
    "keywords": [
                  "DHCP,",
                  "DNS,",
                  "TCP/IP,",
                  "VLAN,",
                  "LACP,",
                  "Nginx,",
                  "Iptables,",
                  "OpenVPN",
		  "Wireshark",
		  "Calico",
		  "Flannel",
		  "Juniper Contrail",
		  "Open vSwitch",
		  "Linux Bridges",
		  "DPDK",
		  "SRIOV"
                ]
    },
    {
      "name": "Load Balancing",
      "level": "Master",
      "keywords": [
	           "Haproxy",
                   "Nginx"
                  ]
    },
    
    {
      "name": "Kernel debugging",
      "level": "Master",
      "keywords": [
	           "Strace",
                   "Gdb"
                  ]
    },
    {
      "name": "Storage",
      "level": "Master",
      "keywords": [
	           "Ceph"
                  ]
    },
    {
      "name": "Amqp Clients",
      "level": "Master",
      "keywords": [
	           "Rabbitmq",
		   "Redhat Messaging",
		   "Apache Qpid"
                  ]
    }



  ]

}
